# atguigu/query_process/nodes/node_rrf.py

from atguigu.query_process.base import NodeBase
from atguigu.query_process.state import QueryGraphState


class NodeRrf(NodeBase):
    """
    节点功能：Reciprocal Rank Fusion
    将多路召回的结果（向量、HyDE、Web）进行加权融合排序。
    """

    # 覆盖基类的 name 属性，标识节点名称
    name: str = "node_rrf"

    def process(self, state: QueryGraphState):

        embedding_chunks, hyde_embedding_chunks = (
            (state["embedding_chunks"]),
            (state["hyde_embedding_chunks"]),
        )
        weight_list = [(embedding_chunks, 1), (hyde_embedding_chunks, 1)]
        temp_dict = {}
        for chunks, weight in weight_list:
            for idx, chunk in enumerate(chunks, start=1):
                score = weight / (idx + 60)
                id = chunk["id"]
                if id not in temp_dict:
                    chunk["score"] = score
                    temp_dict[id] = chunk
                else:
                    temp_dict[id]["score"] = temp_dict[id]["score"] + score
        chunks = sorted(temp_dict.values(), key=lambda x: x["score"], reverse=1)[
            : len(embedding_chunks)
        ]
        return {"rrf_chunks": chunks}


if __name__ == "__main__":
    mock_state = {
        "embedding_chunks": [
            {
                "md_content": "## HAK 180 烫金机\n\n产品安全手册（简体中文）\n\n感谢您购买 HAK 180 烫金机。\n\n在使用本设备之前，请先阅读本手册，包括所有预防措施。阅读本手册后，请妥善保管。\n\n有关使用本设备的更多信息，请参阅使用说明书，其可在兄弟 (中国)商业有限公司技术服务支持网站 http://www.95105369.com/Web/Manuals.aspx 上找到。建议您先通读使用说明书，再使用本设备。\n\n如需获得常见问题解答、故障排除和说明书，请访问\n\nhttp://www.95105369.com。\n\n对于本设备所有者不遵守本指南中规定的说明操作而导致的损害，Brother 不承担任何责任。",
                "item_name": "HAK180烫金机",
                "id": 468771841037442789,
                "title": "## HAK 180 烫金机",
                "file_title": "hak180产品安全手册",
                "source": "local",
                "score": 0.6974701881408691,
            },
            {
                "md_content": "## 设备\n\n![图示禁止将手伸入设备进纸/出纸区域，强调操作时需避免手指进入危险部位，以防夹伤或受伤，符合安全使用规范。](http://192.168.10.4:9000/knowledge-base/hak180产品安全手册/5067b2891ca4f761e2874921e0eb433aa742afbf38ca8dc509afecbf0aa6a6b5.jpg)",
                "item_name": "HAK180烫金机",
                "id": 468771841037442803,
                "title": "## 设备",
                "file_title": "hak180产品安全手册",
                "source": "local",
                "score": 0.695396900177002,
            },
            {
                "md_content": "## 为设备选择一个安全的位置\n\n![正确搬运设备应双手握住机身两侧下方，避免抓握进纸托板或出纸盒；错误方式易致部件脱落，存在安全隐患。](http://192.168.10.4:9000/knowledge-base/hak180产品安全手册/cc5ee1ac24ebb2707d40dc7a234a8b243f55f5bf08fabc683859be6fdf096ffa.jpg)  \n确保本设备的任何部位均未伸出设备所在的桌面或支架。特别是当本设备位于桌面、支架等边缘时，请勿让出纸盒打开。确保本设备位于平整、水平且稳定的表面上，避免震动。不遵守这些预防措施可能导致设备跌落，从而导致用户的人身伤害以及设备严重损坏。",
                "item_name": "HAK180烫金机",
                "id": 468771841037442806,
                "title": "## 为设备选择一个安全的位置",
                "file_title": "hak180产品安全手册",
                "source": "local",
                "score": 0.6908549666404724,
            },
            {
                "md_content": "## 设备\n\n•\t请勿尝试自行维修本设备。打开或拆下盖子可能使您接触到危险电压点以及带来其他风险，并且可能使您的保修失效。对于所有维修事宜，请联系 Brother 呼叫中心或您当地的 Brother 经销商。\n\n•\t请在以下环境使用本设备：温度保持在 10 °C 和 32 °C 之间，湿度保持在 20% 和 80% 之间，无冷凝。\n\n•\t请勿使本设备受到阳光直射、过热、接触明火、腐蚀性气体、湿气或灰尘。否则可能产生触电、短路或火灾的风险，从而导致损坏设备和/或导致设备无法运行。\n\n•\t请勿将设备放在加热器、空调、电风扇或水附近。",
                "item_name": "HAK180烫金机",
                "id": 468771841037442793,
                "title": "## 设备",
                "file_title": "hak180产品安全手册",
                "source": "local",
                "score": 0.6894965767860413,
            },
            {
                "md_content": "## HAK 180 烫金机\n\n•\t对于保养、调整或维修事宜，请联系 Brother 呼叫中心或您当地的Brother 经销商。\n\n•\t如果本设备工作不正常或发生任何错误，请关闭本设备，拔下所有电缆，然后联系 Brother 呼叫中心或您当地的 Brother 经销商。\n\n•\t本文档中提供的信息可能会随时更改，恕不另行通知。\n\n•\t严禁未经授权擅自复制或重制本文档的任何部分或全部内容。\n\n•\t请注意，对于使用通过本设备制作的产品造成的任何损坏或利润损失，或者故障、维修导致的数据消失或更改，或者第三方提出的任何索赔，我们不承担任何责任。",
                "item_name": "HAK180烫金机",
                "id": 468771841037442790,
                "title": "## HAK 180 烫金机",
                "file_title": "hak180产品安全手册",
                "source": "local",
                "score": 0.6868924498558044,
            },
            {
                "md_content": "## 设备\n\n![图片警示：勿触摸设备内部高温区域（≤170°C），避免烫伤；禁止用湿手插拔电源，防止触电；注意有机溶剂腐蚀风险及起搏器用户远离弱磁场区域。](http://192.168.10.4:9000/knowledge-base/hak180产品安全手册/f3349cded08d6686a93d0a81b9a64ec1e50d9a82cbb88541b37027f085813a15.jpg)  \n儎\u245fഴḽ䆜\u0a80ᛞ࠽व䀜\u1aae儎\u245fⲺ䇴༽䜞ԬȾ",
                "item_name": "HAK180烫金机",
                "id": 468771841037442797,
                "title": "## 设备",
                "file_title": "hak180产品安全手册",
                "source": "local",
                "score": 0.6828044056892395,
            },
            {
                "md_content": "## 设备\n\n•\t请勿在卡纸或有纸张散落在设备内部的情况下尝试使用本设备。纸张与定影单元长时间接触可能导致火灾。\n\n请勿使用任何易燃物品、任何类型的喷雾剂包含酒精或氨水的有机溶剂/液体来清洁本设备的内部或外部。否则可能导致火灾。请改用无绒干抹布。有关如何清洁本设备的说明，请参阅 。\n\n•\t请勿将本设备放在化学品附近，或者将本设备放置在可能会泼溅到化学品的位置。万一化学品接触本设备，则存在火灾或触电的风险。特别是有机溶剂或液体（如苯、油漆稀释剂、抛光剂或除臭剂）可能导致塑料盖和/或电缆溶解或分解，从而产生火灾或触电的风险。这些化学品或其他化学品可能导致本设备故障或褪色。",
                "item_name": "HAK180烫金机",
                "id": 468771841037442795,
                "title": "## 设备",
                "file_title": "hak180产品安全手册",
                "source": "local",
                "score": 0.6706825494766235,
            },
            {
                "md_content": "## 设备\n\n•\t将本设备放置在平整、水平且稳定的表面上（如桌面），避免震动和冲击。\n\n•\t将本设备放置在通风良好的环境中。\n\n•\t为了防止人员受伤，请谨慎操作，避免将手指放置在图中所示的区域中。\n\n![图示禁止用手直接触碰设备内部齿轮或传动部件，强调操作时需避免手指进入危险区域，以防夹伤或设备损坏。](http://192.168.10.4:9000/knowledge-base/hak180产品安全手册/c61a7f4e923881679f747508ae309c39dc221685344b068009256b1b3a40cc00.jpg)",
                "item_name": "HAK180烫金机",
                "id": 468771841037442802,
                "title": "## 设备",
                "file_title": "hak180产品安全手册",
                "source": "local",
                "score": 0.6025027632713318,
            },
            {
                "md_content": "## 为设备选择一个安全的位置\n\n![图示禁止将设备放置于桌面或支架边缘，尤其避免出纸盒打开时悬空；应确保设备置于平整、水平、稳固的表面，防止跌落造成人身伤害或设备损坏。](http://192.168.10.4:9000/knowledge-base/hak180产品安全手册/8e839864036a7326885565163d99117ea943ecd29a656c85e7aa4052a9b9d28d.jpg)\n\n“重要事项”表示可能导致财产损失或本设备功能丧失的潜在危险情况。",
                "item_name": "HAK180烫金机",
                "id": 468771841037442807,
                "title": "## 为设备选择一个安全的位置",
                "file_title": "hak180产品安全手册",
                "source": "local",
                "score": 0.567619264125824,
            },
            {
                "md_content": "## 设备\n\n•\t请先阅读这本手册，再尝试操作本设备或尝试进行任何维护。不按照这些说明操作可能会提高发生人员受伤或财产损坏（包括火灾、触电、烧伤或窒息所致）的风险。对于本设备所有者不遵守本指南中规定的说明操作而导致的损害，Brother 不承担任何责任。\n\n•\t请勿在未去除所有包装材料的情况下使用本设备，包括本设备内部的任何附加的包装材料。否则可能会产生火灾的风险。\n\n•\t请勿拆解本设备。拆解本设备可能会导致火灾或触电。",
                "item_name": "HAK180烫金机",
                "id": 468771841037442792,
                "title": "## 设备",
                "file_title": "hak180产品安全手册",
                "source": "local",
                "score": 0.5579946637153625,
            },
        ],
        "hyde_embedding_chunks": [
            {
                "item_name": "HAK180烫金机",
                "id": 468771841037442802,
                "title": "## 设备",
                "file_title": "hak180产品安全手册",
                "md_content": "## 设备\n\n•\t将本设备放置在平整、水平且稳定的表面上（如桌面），避免震动和冲击。\n\n•\t将本设备放置在通风良好的环境中。\n\n•\t为了防止人员受伤，请谨慎操作，避免将手指放置在图中所示的区域中。\n\n![图示禁止用手直接触碰设备内部齿轮或传动部件，强调操作时需避免手指进入危险区域，以防夹伤或设备损坏。](http://192.168.10.4:9000/knowledge-base/hak180产品安全手册/c61a7f4e923881679f747508ae309c39dc221685344b068009256b1b3a40cc00.jpg)",
                "source": "local",
                "score": 0.7507860064506531,
            },
            {
                "item_name": "HAK180烫金机",
                "id": 468771841037442797,
                "title": "## 设备",
                "file_title": "hak180产品安全手册",
                "md_content": "## 设备\n\n![图片警示：勿触摸设备内部高温区域（≤170°C），避免烫伤；禁止用湿手插拔电源，防止触电；注意有机溶剂腐蚀风险及起搏器用户远离弱磁场区域。](http://192.168.10.4:9000/knowledge-base/hak180产品安全手册/f3349cded08d6686a93d0a81b9a64ec1e50d9a82cbb88541b37027f085813a15.jpg)  \n儎\u245fഴḽ䆜\u0a80ᛞ࠽व䀜\u1aae儎\u245fⲺ䇴༽䜞ԬȾ",
                "source": "local",
                "score": 0.7370108366012573,
            },
            {
                "item_name": "HAK180烫金机",
                "id": 468771841037442798,
                "title": "## 设备",
                "file_title": "hak180产品安全手册",
                "md_content": "## 设备\n\n![图片展示一只手正操作打印机内部部件（如感光鼓或定影组件），提示用户在维护时需注意安全：设备内部零件高温，勿触摸灰色标记区域；同时强调塑料袋非玩具、起搏器用户远离弱磁场设备等风险防范事项。](http://192.168.10.4:9000/knowledge-base/hak180产品安全手册/501bb8d2d681e4502d87badb15a68939eadfa086d309c3599f1c36b0bc559177.jpg)",
                "source": "local",
                "score": 0.733599066734314,
            },
            {
                "item_name": "HAK180烫金机",
                "id": 468771841037442803,
                "title": "## 设备",
                "file_title": "hak180产品安全手册",
                "md_content": "## 设备\n\n![图示禁止将手伸入设备进纸/出纸区域，强调操作时需避免手指进入危险部位，以防夹伤或受伤，符合安全使用规范。](http://192.168.10.4:9000/knowledge-base/hak180产品安全手册/5067b2891ca4f761e2874921e0eb433aa742afbf38ca8dc509afecbf0aa6a6b5.jpg)",
                "source": "local",
                "score": 0.7321503758430481,
            },
            {
                "item_name": "HAK180烫金机",
                "id": 468771841037442806,
                "title": "## 为设备选择一个安全的位置",
                "file_title": "hak180产品安全手册",
                "md_content": "## 为设备选择一个安全的位置\n\n![正确搬运设备应双手握住机身两侧下方，避免抓握进纸托板或出纸盒；错误方式易致部件脱落，存在安全隐患。](http://192.168.10.4:9000/knowledge-base/hak180产品安全手册/cc5ee1ac24ebb2707d40dc7a234a8b243f55f5bf08fabc683859be6fdf096ffa.jpg)  \n确保本设备的任何部位均未伸出设备所在的桌面或支架。特别是当本设备位于桌面、支架等边缘时，请勿让出纸盒打开。确保本设备位于平整、水平且稳定的表面上，避免震动。不遵守这些预防措施可能导致设备跌落，从而导致用户的人身伤害以及设备严重损坏。",
                "source": "local",
                "score": 0.7238988280296326,
            },
            {
                "item_name": "HAK180烫金机",
                "id": 468771841037442799,
                "title": "## 电源线",
                "file_title": "hak180产品安全手册",
                "md_content": "## 电源线\n\n•\t本设备通过 AC 220 V-240 V 50/60 Hz 电源供电。\n\n请勿将本设备连接到直流电源或逆变器（直流交流变换器）。存在火灾或触电的风险。\n\n•\t请勿用湿手触摸插头。这样可能导致触电。如果不确定您拥有哪种类型的电源，请联系合格的电工。\n\n•\t始终确保插头已完全插入。如果电源线磨损或损坏，请勿使用设备或用手触摸电源线。\n\n•\t设备内部有高压电极。\n\n先拔掉电源线，再清洁设备内部。拔出电源线时，不要拉电线，而是捏住插头往外拔。存在发生火灾、触电或设备故障的风险。\n\n•\t请勿将任何物体压在电源线上。\n\n•\t请勿将本设备放在人们可能踏过电源线的位置。",
                "source": "local",
                "score": 0.6962820291519165,
            },
            {
                "item_name": "HAK180烫金机",
                "id": 468771841037442788,
                "title": "无标题",
                "file_title": "hak180产品安全手册",
                "md_content": "![该图片为HAK 180烫金机产品安全手册封面，包含条形码、型号D01WD7001-00、品牌SCHN及中文使用说明，强调使用前须阅读手册并妥善保管。](http://192.168.10.4:9000/knowledge-base/hak180产品安全手册/677a08ee041965bbbdb6b483d6c17d5aaa36a26b6dc96870a2019f0307b8616f.jpg)  \nD01WD7001-00\n\nSCHN\n",
                "source": "local",
                "score": 0.5939905047416687,
            },
            {
                "item_name": "HAK180烫金机",
                "id": 468771841037442789,
                "title": "## HAK 180 烫金机",
                "file_title": "hak180产品安全手册",
                "md_content": "## HAK 180 烫金机\n\n产品安全手册（简体中文）\n\n感谢您购买 HAK 180 烫金机。\n\n在使用本设备之前，请先阅读本手册，包括所有预防措施。阅读本手册后，请妥善保管。\n\n有关使用本设备的更多信息，请参阅使用说明书，其可在兄弟 (中国)商业有限公司技术服务支持网站 http://www.95105369.com/Web/Manuals.aspx 上找到。建议您先通读使用说明书，再使用本设备。\n\n如需获得常见问题解答、故障排除和说明书，请访问\n\nhttp://www.95105369.com。\n\n对于本设备所有者不遵守本指南中规定的说明操作而导致的损害，Brother 不承担任何责任。",
                "source": "local",
                "score": 0.5895141959190369,
            },
            {
                "item_name": "HAK180烫金机",
                "id": 468771841037442807,
                "title": "## 为设备选择一个安全的位置",
                "file_title": "hak180产品安全手册",
                "md_content": "## 为设备选择一个安全的位置\n\n![图示禁止将设备放置于桌面或支架边缘，尤其避免出纸盒打开时悬空；应确保设备置于平整、水平、稳固的表面，防止跌落造成人身伤害或设备损坏。](http://192.168.10.4:9000/knowledge-base/hak180产品安全手册/8e839864036a7326885565163d99117ea943ecd29a656c85e7aa4052a9b9d28d.jpg)\n\n“重要事项”表示可能导致财产损失或本设备功能丧失的潜在危险情况。",
                "source": "local",
                "score": 0.5696575045585632,
            },
            {
                "item_name": "HAK180烫金机",
                "id": 468771841037442792,
                "title": "## 设备",
                "file_title": "hak180产品安全手册",
                "md_content": "## 设备\n\n•\t请先阅读这本手册，再尝试操作本设备或尝试进行任何维护。不按照这些说明操作可能会提高发生人员受伤或财产损坏（包括火灾、触电、烧伤或窒息所致）的风险。对于本设备所有者不遵守本指南中规定的说明操作而导致的损害，Brother 不承担任何责任。\n\n•\t请勿在未去除所有包装材料的情况下使用本设备，包括本设备内部的任何附加的包装材料。否则可能会产生火灾的风险。\n\n•\t请勿拆解本设备。拆解本设备可能会导致火灾或触电。",
                "source": "local",
                "score": 0.5669312477111816,
            },
        ],
    }
    rrf = NodeRrf()
    rrf(mock_state)
